src/main/resource/bq/cxf/tutorial/soapheader/soap_message_send

POST /jaxws/ws/echoheaderservice HTTP/1.1
Content-Type: text/xml; charset=UTF-8
Accept: */*
SOAPAction: "http://bq.cxf.tutorial/echoheaderservice/echoHeader"
User-Agent: Apache CXF 2.7.8
Cache-Control: no-cache
Pragma: no-cache
Host: 127.0.0.1:9999
Connection: keep-alive
Content-Length: 443

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <ns2:messageHeader xmlns:ns2="http://bq.cxf.tutorial/echoservicewithheader/">
         <sender>GOD</sender>
         <isEncypt>true</isEncypt>
      </ns2:messageHeader>
   </soap:Header>
   <soap:Body>
      <ns2:message xmlns:ns2="http://bq.cxf.tutorial/echoservicewithheader/">
         <id>message01</id>
         <name>offer from heaven</name>
         <content>hello, world!</content>
      </ns2:message>
   </soap:Body></soap:Envelope>